Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabDbChangeConn Property
 Fabrication Database changes altered connectivity
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabDbChangeConn { get; }
Public Shared ReadOnly Property FabDbChangeConn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabDbChangeConn {
	FailureDefinitionId^ get ();
}
static member FabDbChangeConn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace